[
    {
        "prj_id": 1,
        "name": "visualiseur d'algorithme de tri",
        "description": "Ce projet est conçu pour aider à visualiser la logique de tri de divers algorithmes de tri et à améliorer la compréhension grâce à des visuels."
    },
    {
        "prj_id": 2,
        "name": "visualiseur de recherche de chemin",
        "description": "Ce projet est conçu pour aider à visualiser comment divers algorithmes de recherche de chemin tentent de trouver le chemin le plus court entre le nœud de départ et le nœud cible dans le graphe."
    },
    {
        "prj_id": 3,
        "name": "vidtalkie",
        "description": "L'application Web, un clone de l'une des applications les plus utilisées, présente les fonctionnalités de base telles que la connexion à l'aide de l'authentification Google, les pages de profil, le téléchargement de vidéos, les vidéos aimées, les commentaires, la recherche et le filtrage de vidéos et de comptes."
    },
    {
        "prj_id": 4,
        "name": "gérant de l'épicerie",
        "description": "L'application est une simulation du gérant de l'épicerie. Elle charge les données du fichier ou de la saisie manuelle et vérifie si les données sont valides et dans la plage des nombres valides, si elles ne sont pas saisies manuellement. programme lit l'identifiant du produit et la quantité pour les ajouter au panier d'achat en cours. Une fois les articles sélectionnés, le programme imprime le récapitulatif de l'achat en cours avec les informations sur les taxes et le total. Lorsque le programme est arrêté, il génère le message 'Fin de récapitulatif du jour', où il indique le coût total des articles vendus, le nombre de ventes et le nombre moyen d'articles par vente ainsi qu'un récapitulatif du stock restant et le classement des meilleurs vendeurs dans chaque catégorie."
    },
    {
        "prj_id": 5,
        "name": "jeu de maths",
        "description": "L'application de jeu conçue en C pour s'amuser et mettre à l'épreuve vos compétences en mathématiques."
    },
    {
        "prj_id": 6,
        "name": "application Web de l'entreprise",
        "description": "Application Web conçue pour montrer comment se connecter au système, récupérer les données actuelles des employés et des services, ajouter, supprimer et modifier les données actuelles dans la base de données de l'entreprise."
    },
    {
        "prj_id": 7,
        "name": "demande de mise en état d'un hôpital général",
        "description": "Un programme pour les hôpitaux pour les aider à trier leurs patients. Il trie le patient en fonction du besoin du test Covid. Le programme attribue le type de patience selon si le test covid est nécessaire. Selon le groupe , un patient doit entrer les données d'un médecin. Après cela, le ticket est donné avec le temps d'attente prévu, le numéro dans la ligne."
    },
    {
        "prj_id": 8,
        "name": "simulation de chaîne de montage",
        "description": "Simulation d'un ensemble constitué d'un ensemble de postes de travail contenant chacun un ensemble d'articles en stock, spécifiques à la station. Un responsable de ligne déplace les commandes des clients le long de la ligne remplissant les commandes à chaque station, au fur et à mesure demandé. Chaque commande client consiste en une liste d'articles qui doivent être remplis. Chaque station traite une file d'attente de commandes en remplissant la commande suivante dans la file d'attente si cette commande demande l'article de la station et que cet article est en stock. déplacer les commandes des clients d'un poste à l'autre jusqu'à ce que toutes les commandes aient été traitées."
    }
]
